{"class_name": "Functional", "config": {"name": "model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null], "dtype": "string", "sparse": false, "ragged": false, "name": "text"}, "name": "text", "inbound_nodes": []}, {"class_name": "KerasLayer", "config": {"name": "keras_layer", "trainable": false, "dtype": "float32", "handle": "https://tfhub.dev/tensorflow/bert_en_uncased_preprocess/3"}, "name": "keras_layer", "inbound_nodes": [[["text", 0, 0, {}]]]}, {"class_name": "KerasLayer", "config": {"name": "keras_layer_1", "trainable": false, "dtype": "float32", "handle": "https://tfhub.dev/tensorflow/bert_en_uncased_L-12_H-768_A-12/4"}, "name": "keras_layer_1", "inbound_nodes": [{"input_word_ids": ["keras_layer", 0, 2, {}], "input_mask": ["keras_layer", 0, 0, {}], "input_type_ids": ["keras_layer", 0, 1, {}]}]}, {"class_name": "Dropout", "config": {"name": "dropout", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "name": "dropout", "inbound_nodes": [[["keras_layer_1", 0, 13, {}]]]}, {"class_name": "Dense", "config": {"name": "output", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "output", "inbound_nodes": [[["dropout", 0, 0, {}]]]}], "input_layers": [["text", 0, 0]], "output_layers": [["output", 0, 0]]}, "keras_version": "2.6.0", "backend": "tensorflow"}